#+title: Day20

**** Example Code
#+BEGIN_SRC C :tangle mpi_cart.c :results output :exports both
#include <mpi.h>
#include <stdio.h>

int main(int argc, char** argv) {
    MPI_Init(&argc, &argv);

    int rank, size;
    MPI_Comm_rank(MPI_COMM_WORLD, &rank);
    MPI_Comm_size(MPI_COMM_WORLD, &size);

    int dims[2] = {0, 0};
    MPI_Dims_create(size, 2, dims); // Automatically create a balanced 2D grid
    int periods[2] = {0, 0}; // No wrap-around connections
    MPI_Comm cart_comm;
    MPI_Cart_create(MPI_COMM_WORLD, 2, dims, periods, 0, &cart_comm);

    int coords[2];
    MPI_Cart_coords(cart_comm, rank, 2, coords);
    printf("Rank %d has coordinates (%d, %d)\n", rank, coords[0], coords[1]);

    // Cleanup
    MPI_Comm_free(&cart_comm);

    MPI_Finalize();
    return 0;
}
#+END_SRC

#+begin_src bash :results output :exports both
bash compile.sh mpi_cart.c
#+end_src

#+RESULTS:
: ------------------------------------------------------------------
: Command executed: mpicc mpi_cart.c -o mpi_cart.out -lm -fopenmp
: ------------------------------------------------------------------
: Compilation successful. Check at mpi_cart.out
: ------------------------------------------------------------------

#+begin_src bash :results output :exports both
bash run.sh ./mpi_cart.out 2
#+end_src

#+RESULTS:
#+begin_example
------------------------------------------------------------------
Command executed: mpirun -np 2 ./mpi_cart.out
------------------------------------------------------------------
##################################################################
##########                    OUTPUT                    ##########
##################################################################

Rank 0 has coordinates (0, 0)
Rank 1 has coordinates (1, 0)

##################################################################
##########                     DONE                     ##########
##################################################################
#+end_example

* MPI_Barrier
#+begin_src C :tangle barrier.c
#include <mpi.h>
#include <stdio.h>
#include <unistd.h>

int main(int argc, char** argv) {
    MPI_Init(&argc, &argv);

    int rank, size;
    MPI_Comm_rank(MPI_COMM_WORLD, &rank);
    MPI_Comm_size(MPI_COMM_WORLD, &size);

    if (rank == 0) {
        printf("Process %d: Preparing data...\n", rank);
        sleep(2); // Simulate data preparation
    }

    printf("Process %d: Waiting at the barrier.\n", rank);
    MPI_Barrier(MPI_COMM_WORLD);

    printf("Process %d: Proceeding to next phase.\n", rank);

    MPI_Finalize();
    return 0;
}


#+end_src

#+begin_src bash :results output :exports both
bash compile.sh barrier.c
#+end_src

#+RESULTS:
: ------------------------------------------------------------------
: Command executed: mpicc barrier.c -o barrier.out -lm -fopenmp
: ------------------------------------------------------------------
: Compilation successful. Check at barrier.out
: ------------------------------------------------------------------

#+begin_src bash :results output :exports both
bash run.sh ./barrier.out 5
#+end_src

#+RESULTS:
#+begin_example
------------------------------------------------------------------
Command executed: mpirun -np 5 ./barrier.out
------------------------------------------------------------------
##################################################################
##########                    OUTPUT                    ##########
##################################################################

Process 4: Waiting at the barrier.
Process 3: Waiting at the barrier.
Process 2: Waiting at the barrier.
Process 0: Preparing data...
Process 1: Waiting at the barrier.
Process 0: Waiting at the barrier.
Process 0: Proceeding to next phase.
Process 2: Proceeding to next phase.
Process 3: Proceeding to next phase.
Process 4: Proceeding to next phase.
Process 1: Proceeding to next phase.

##################################################################
##########                     DONE                     ##########
##################################################################
#+end_example
